NACA2415_rotating/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    wall1
    {
        type            patch;
        nFaces          1215;
        startFace       2889264;
    }
    wall2
    {
        type            patch;
        nFaces          1215;
        startFace       2890479;
    }
    wall3
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2025;
        startFace       2891694;
    }
    wall4
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3402;
        startFace       2893719;
    }
    wall5
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4566;
        startFace       2897121;
    }
    wall6
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2205;
        startFace       2901687;
    }
    AMI
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          22289;
        startFace       2903892;
    }
    AMI_slave
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          22599;
        startFace       2926181;
    }
    wing
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          68722;
        startFace       2948780;
    }
)

// ************************************************************************* //
