NACA2415_rotating/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
AMI
{

	surfaces ("AMI.stl");


	includedAngle 150;

	subsetFeatures
	{

		nonManifoldEdges no;
	
		openEdges yes;
	
	}
}

NACA2415_openfoam
{

	surfaces ("NACA2415_openfoam.stl");


	includedAngle 150;

	subsetFeatures
	{

		nonManifoldEdges no;
	
		openEdges yes;
	
	}
}
// ************************************************************************* //
